In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sn

## importing DataSet

In [4]:
too = pd.read_csv("toyota.csv",index_col=0,na_values=["??","???"])
tot = too.copy()
tot.head(2)

       year  price transmission  mileage fuelType  tax   mpg  engineSize
model
 GT86  2016  16000       Manual    24089   Petrol  265  36.2         2.0
 GT86  2017  15995       Manual    18615   Petrol  145  36.2         2.0

## Identifing missing Value
- for this, we use tow function
    - isnull
    - isna

In [5]:
tot.isnull().sum()

year            0
price           0
transmission    0
mileage         0
fuelType        0
tax             0
mpg             0
engineSize      0
dtype: int64

### No Missing Value

# add anohter DataSet

In [8]:
too = pd.read_csv("titanic_train.csv",index_col= 0,na_values=["??","???"])
tot = too.copy()
tot.head(2)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

### Check For Missing Value

In [9]:
tot.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64